---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyImportInstancesAcrossProjects
source: html/748c8c81-f18e-0141-b2c4-4fb7aaffa253.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyImportInstancesAcrossProjects Property

Linked Imported Files cannot be copied across projects. All non-RVT linked files will be pasted as imports instead.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCopyImportInstancesAcrossProjects { get; }
```